# задача 1 

print (int(673.3123)) #строка 673 из float превратится в integer
print (float(512)) #строка 512.0 из integer превратится в float
print (int(float(str(192)))) #останится без изминений
print (float(173) + 5)  #строка 178.0 из integer превратится в float 
print (str(193.000000000001)) #останится без измений

#задача 2

#что такое конкатенация? Объясните следующие две строки кода:
print ('calling'+ str(911)) # calling и 911 станит одним целым
print ('abc' + 'xyz') #станит одним целым

#задача 3

print(589 + 932.901) 
print('Hello world' + '892.01')

#задача 4

print ('Hello world' , '892.01', 932.901,  589,  1481.01)
